{"Anna Lorimer":{"name":"<h2 id=\"annalorimer\">Anna Lorimer</h2>","title":"<h3 id=\"zipzipohno\">Zip, Zip, Oh no!</h3>","link":"https://twitter.com/securitanna","linkicon":"<i class=\"fab fa-twitter\"></i>","bio":"Anna is a student at the University of Waterloo with a really long degree name. She’s an intern NCC Group and has worked in the UWaterloo CrySP lab. She has a cat named Lemon who is a real sourpuss. /","profilepic":"<img src=\"speakers/Anna Lorimer.jpg\" alt=\"loading profile picture...\" />","abstract":"You’ve probably heard the saying “Don’t Roll Your Own Crypto”, but what does that actually mean? In this talk we’ll have a look at the the catastrophically ineffective PKZIP encryption algorithm that Linux’s zip tool initially used, an attack against it, and what this failure can teach us about implementing encryption algorithms today."},"Andrew Ling":{"name":"<h2 id=\"andrewling\">Andrew Ling</h2>","title":"<h3 id=\"fpgastheperfectspatialprocessor\">FPGAs: the perfect spatial processor</h3>","link":"","linkicon":"","bio":"Andrew Ling is an engineering manager for the FPGA deep learning acceleration team in Intel's Toronto Technology Centre.  He received his Ph.D. from the University of Toronto in 2009.","profilepic":"<img src=\"speakers/Andrew Ling.jpg\" alt=\"loading profile picture...\" />","abstract":"Von Neuman Architectures are so 1990 - FPGAs: the perfect spatial processor for 2020 and beyond and how to program to it"},"Arshia Mufti":{"name":"<h2 id=\"arshiamufti\">Arshia Mufti</h2>","title":"<h3 id=\"wrinklesintimekeeping\">Wrinkles in Timekeeping</h3>","link":"https://twitter.com/arshia__","linkicon":"<i class=\"fab fa-twitter\"></i>","bio":"Arshia is a research student in the Data Systems Group at the University of Waterloo, an organizer of StarCon, and probably hungry right about now.","profilepic":"<img src=\"https://pbs.twimg.com/profile_images/888292857315958784/jxMWpjfp_400x400.jpg\" alt=\"loading profile picture...\" />","abstract":"Tracking time is easy for humans, but why is it so hard for computers? When a group of computers talk to each other, a critical component of their communication is the way they keep time. Mechanisms like hardware clocks, logical timestamps, and NTP (network time protocol) have all been used to try to solve the same problem: how can distributed systems track time in synchrony? This talk will cover the timekeeping mechanisms used by popular databases today, but more broadly, explore what time fundamentally *means* to a computer system."},"Ridwan Howlader":{"name":"<h2 id=\"ridwanhowlader\">Ridwan Howlader</h2>","title":"<h3 id=\"impactfulmultidisciplinaryinnovation\">Impactful &amp; Multidisciplinary Innovation</h3>","link":"","linkicon":"","bio":"Ridwan Howlader is the Executive Director of the University of Toronto Aerospace Team. He is a multidisciplinary leader who is passionate about facilitating growth of innovative and high-impact teams.","profilepic":"<img src=\"speakers/Ridwan Howlader.jpg\" alt=\"loading profile picture...\" />","abstract":"Planes, trains, automobiles, spacecraft, laptops, cameras, light bulbs, microwave ovens... the list could go on. Some of these are very conventional every day items, while others are technological marvels. All of these items have had a significant impact on society and its technical advancements. The development of software and design tools has advanced multidisciplinary innovation. The culture of digitization has enabled the growth of automation, and has resulted in an enriched quality of life. Students can capitalize on opportunities in these fields and potentially have a large impact."},"Stephen Piron":{"name":"<h2 id=\"stephenpiron\">Stephen Piron</h2>","title":"<h3 id=\"connectingthedotswithdeeplearning\">Connecting the Dots with DeepLearni.ng</h3>","link":"http://deeplearni.ng/","linkicon":"<i class=\"fas fa-link\"></i>","bio":"Stephen is co-founder of DeepLearni.ng, a company that builds real-world AI for enterprises. Stephen is also a UofT Comp Sci and IEEE alum, and used to avidly await the latest editions of Spectrum. ","profilepic":"<img src=\"speakers/Stephen Piron.png\" alt=\"loading profile picture...\" />","abstract":"What kind of future are you building? In 2018, AI--and especially deep learning--has captured the imagination of many. Connect the dots and discover what's led to the field's current success in Toronto and around the world with DeepLearni.ng’s co-founder Stephen Piron.  "}}